app/controllers/movies_controller.rb

  def create
  	movie = Movie.new(title: params[:title], year: params[:year], poster_url: params[:poster_url], plot: params[:plot])
  	movie.save
---
INSERT INTO "movies" ("title", "year", "poster_url", "plot", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"